### Data Storage, Storage, File Format Using Pandas

#### Reading and Writing data in text format

In [3]:
import pandas as pd
import numpy as np

In [4]:
Dataframe = pd.read_csv('./Dataset/ex1.csv')

In [5]:
Dataframe

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
Dataframe1 = pd.read_table('./Dataset/ex1.csv')

In [9]:
Dataframe1

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [12]:
Dataframe2 = pd.read_csv('./Dataset/ex2.csv',header=None)

In [13]:
Dataframe2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [17]:
Dataframe3 = pd.read_csv('./Dataset/ex2.csv',names=['a','b','c','d','Greeting'])

In [18]:
Dataframe3

   a   b   c   d Greeting
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [21]:
Dataframe4 = pd.read_csv('./Dataset/ex2.csv',names=['a','b','c','d','Greeting'],index_col=['Greeting'])

In [22]:
Dataframe4

          a   b   c   d
Greeting
hello     1   2   3   4
world     5   6   7   8
foo       9  10  11  12

In [23]:
Dataframe5 = pd.read_csv('./Dataset/mindex.csv')

In [24]:
Dataframe5

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [25]:
Dataframe6= pd.read_csv('./Dataset/mindex.csv',index_col=['key1','key2'])

In [26]:
Dataframe6

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [36]:
Dataframe7= pd.read_csv('./Dataset/ex3.txt',sep='\s+')

In [37]:
Dataframe7

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [38]:
Dataframe8 = pd.read_csv('./Dataset/ex4.csv')

In [39]:
Dataframe8

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [41]:
Dataframe8= pd.read_csv('./Dataset/ex4.csv', header=[1])

In [42]:
Dataframe8

,a,b,c,d,message
0,# just wanted to make things more difficult fo...,NaN,NaN,NaN,NaN
1,# who reads CSV files with computers,anyway?,NaN,NaN,NaN
2,1,2,3.0,4.0,hello
3,5,6,7.0,8.0,world
4,9,10,11.0,12.0,foo

In [44]:
Dataframe8 = pd.read_csv('./Dataset/ex4.csv',skiprows=[0,2,3])

In [45]:
Dataframe8

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
Dataframe9 = pd.read_csv('./Dataset/ex5.csv')
Dataframe9

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
pd.isnull(Dataframe9)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [48]:
pd.isna(Dataframe9)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [57]:
Dataframe9 = pd.read_csv('./Dataset/ex5.csv',na_values=['12'])

In [58]:
Dataframe9

  something  a   b     c    d message
0       one  1   2   3.0  4.0     NaN
1       two  5   6   NaN  8.0   world
2     three  9  10  11.0  NaN     foo

In [60]:
sentinels={'message':['world','foo']}
Dataframe10 = pd.read_csv('./Dataset/ex5.csv',na_values=sentinels)

In [61]:
Dataframe10

  something  a   b     c   d  message
0       one  1   2   3.0   4      NaN
1       two  5   6   NaN   8      NaN
2     three  9  10  11.0  12      NaN

#### Reading text file into pieces

In [62]:
pd.options.display.max_rows

60

In [65]:
pd.options.display.max_rows=10

In [71]:
Dataframe11=pd.read_csv('./Dataset/ex6.csv',nrows=10)

In [72]:
Dataframe11

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q
5  1.817480  0.742273  0.419395 -2.251035   Q
6 -0.776764  0.935518 -0.332872 -1.875641   U
7 -0.913135  1.530624 -0.572657  0.477252   K
8  0.358480 -0.497572 -0.367016  0.507702   S
9 -1.740877 -1.160417 -1.637830  2.172201   G

In [81]:
chunker=pd.read_csv('./Dataset/ex6.csv',chunksize=10)

In [82]:
chunker

In [83]:
type(chunker)

pandas.io.parsers.TextFileReader

In [84]:
dir(chunker)

['__abstractmethods__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__enter__',
 '__eq__',
 '__exit__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__next__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__slots__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_abc_impl',
 '_check_file_or_buffer',
 '_clean_options',
 '_currow',
 '_engine',
 '_engine_specified',
 '_failover_to_python',
 '_get_options_with_defaults',
 '_make_engine',
 'chunksize',
 'close',
 'engine',
 'f',
 'get_chunk',
 'nrows',
 'options',
 'orig_options',
 'read',
 'squeeze']

In [85]:
tot = pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)
tot=tot.sort_values(ascending=False)

<ipython-input-85-df0be6582931>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [86]:
tot

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
     ...
5    157.0
2    152.0
0    151.0
9    150.0
1    146.0
Length: 36, dtype: float64

#### Writing data to text format

In [87]:
data = pd.read_csv('./Dataset/ex5.csv')

In [88]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [89]:
data.to_csv('./Dataset/Output.csv')

In [90]:
import sys
data.to_csv(sys.stdout,sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [92]:
data.to_csv(sys.stdout,na_rep="Null",sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|Null
1|two|5|6|Null|8|world
2|three|9|10|11.0|12|foo

In [95]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [99]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'],na_rep="Null")

a,b,c
1,2,3.0
5,6,Null
9,10,11.0

In [100]:
dates = pd.date_range('1/1/2000',periods=7)

In [101]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')